Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions.GetMassZoneIds
Gets a list of mass zones to analyze in the exported gbXML.
Returns:
The ids of the mass zone.
Since:
2012

Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions.GetMassIds
Gets a list of masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
Returns:
The ids of the masses.
Since:
2012

Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Constructs a new instance of the options used to export a mass model to gbXML.
massZoneIds:
Indicates the mass zones to analyze in the exported gbXML.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Constructs a new instance of the options used to export a mass model to gbXML.
massZoneIds:
Indicates the mass zones to analyze in the exported gbXML.
massIds:
Indicates the masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions
Options used when exporting a gbXML file from a mass model document.
Since:
2012